# 4.9 Tasks part 1

#### 1. import libraries

#### 2. Wrangle dataframe df_customers

#### 3. Fundamental data quality and consistency checks

#### 4. Combine customers data with orders_products_grouped data 


## 1.

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
#set scripts path in variable 'path'
path = r'/Users/constantinmelachrinos/Documents/careerfoundry data analyst/Course files/Data Analytics Immersion/Achievement 4 - InstaCart - Python/Instacart Basket Analysis'

#import Instacart data_sets
ords_prods_grouped = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'orders_products_grouped.pkl'))
df_customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

# 2. Wrangle dataframe df_customers

In [3]:
#look at customers dataframe
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
df_customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [5]:
df_customers.shape

(206209, 10)

In [6]:
df_customers.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

### After looking at the dataframe i have made some conclusions:
#### 1. Rename column headers
#### 2. After rereading the project brief i am considering to delete column n_dependants and date_joined since its not important for our analysis.

## 2.1 Rename column headers

In [7]:
#rename columns
df_customers=df_customers.rename(columns={'First Name': 'first_name', 'Surnam': 'last_name', 'Gender': 'gender', 'STATE': 'state', 'Age': 'age'})

In [8]:
#check if executed correctly
df_customers.head()

,user_id,first_name,last_name,gender,state,age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## 2.2 Dropping columns

In [9]:
# dropping columns date_joined'
df_customers=df_customers.drop(['date_joined'], axis=1)

In [10]:
#check if executed correctly
df_customers.head()

,user_id,first_name,last_name,gender,state,age,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374

## 2.3 Change data type of 'user_id'

In [11]:
#change data type from int64 to string
df_customers = df_customers.astype({'user_id': int})

In [12]:
#check if executed accordingly
df_customers.dtypes

user_id          int64
first_name      object
last_name       object
gender          object
state           object
age              int64
n_dependants     int64
fam_status      object
income           int64
dtype: object

# 3. Data quality checks

### 1. Check and address missing data
### 2. Check and address duplicates
### 3. Convert mixed data types

### 3.1 check and address missing data

In [13]:
#check if there are any missing values in any columns in the dataframe
df_customers.isnull().sum()

user_id             0
first_name      11259
last_name           0
gender              0
state               0
age                 0
n_dependants        0
fam_status          0
income              0
dtype: int64

#### column first_name has missing values. Since we dont really need the first_name of a customer for our analysis i wont do anything with it because we have the user_id to identify this user.

### 3.2 check and address duplicates

In [14]:
#write duplicates in a new dataframe called 'df_customers_dups'
df_customers_dups = df_customers[df_customers.duplicated()]

In [15]:
df_customers_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, n_dependants, fam_status, income]
Index: []

#### no duplicates found

### 3.3 convert mixed data types

In [16]:
#check for mixed types
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

first_name

#### first_name has mixed data types

In [17]:
#convert all data types in column 'first_name' to string
df_customers['first_name'] = df_customers['first_name'].astype('str')

In [18]:
#check if no mixed data types anymore
for col in df_customers.columns.tolist():
  weird = (df_customers[[col]].map(type) != df_customers[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_customers[weird]) > 0:
    print (col)

#### no mixd data types found

# 4. Combine customers data with orders_products_grouped data

### 1. Check if column user_id is of same data type
### 2. Combine the two data frames

### 4.1 check if column user_id is same data type

In [19]:
#check type of both columns are the same
df_customers['user_id'].dtypes == ords_prods_grouped['user_id'].dtypes

True

#### as we can see the data types are the same so we can combine them

### 4.2 Combine the two data frames

In [21]:
#Drop column '_merge' from last merging process
ords_prods_grouped=ords_prods_grouped.drop(['_merge'], axis=1)

In [22]:
#Merge the two dataframes with eachother and write it in new dataframe called 
ords_prods_customer_merged = ords_prods_grouped.merge(df_customers, on = 'user_id', indicator = True, how ='inner')

In [23]:
#check if merging executed correctly
ords_prods_customer_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,first_order,product_id,add_to_cart_order,reordered,...,order_behaviour,first_name,last_name,gender,state,age,n_dependants,fam_status,income,_merge
0,2539329,1,1,2,8,NaN,1,196,1,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
1,2539329,1,1,2,8,NaN,1,14084,2,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
2,2539329,1,1,2,8,NaN,1,12427,3,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
3,2539329,1,1,2,8,NaN,1,26088,4,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both
4,2539329,1,1,2,8,NaN,1,26405,5,0,...,Non-frequent customer,Linda,Nguyen,Female,Alabama,31,3,married,40423,both

### Export dataframe

In [24]:
#export dataframe to pickle format
ords_prods_customer_merged.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'orders_products_customers_combined.pkl'))